### Task: Generate a Dynamic Report on Monthly Sales for Each Product

#### Scenario
You are tasked with creating a **monthly sales report** for all products. Each month, new products are being introduced, and you don’t know in advance which products will be sold in the upcoming months. The requirement is to **dynamically generate a report** that shows the total sales for each product, broken down by month.

#### Task Details
- You need to create a query that **dynamically generates columns** for each month (e.g., "January," "February," etc.), showing the total sales for all products sold in that month.
- Products that appear in the future must also automatically be included in the report, without changing the query manually.

#### Example Output
Your final table should look something like this:
| Product Name | January Sales | February Sales | March Sales | ... |
|--------------|---------------|----------------|-------------|-----|
| Laptop       | $5000         | $6000          | $7000       | ... |
| Smartphone   | $4000         | $5000          | $4500       | ... |
| Headphones   | $2000         | $2500          | $3000       | ... |
### Why Dynamic SQL is Needed
- **Dynamic Columns**: You don’t know in advance how many months of data you will have, and manually listing every month would be impractical.
- **Changing Data**: New products and sales months could appear over time, and your report needs to adapt.

#### Requirements for the Query:
1. Dynamically generate columns for each month based on the available sales data.
2. Each product should have its own row.
3. Each month should have its total sales value as a column.

#### Dataset Example
To set up a dataset to work with, you can create a table `Sales` with the following fields:
- **ProductID**: Unique ID for each product.
- **ProductName**: Name of the product.
- **SaleDate**: Date of the sale.
- **Quantity**: Number of units sold.
- **Price**: Price per unit.

For example:
```sql
CREATE TABLE Sales (
    ProductID INT,
    ProductName VARCHAR(100),
    SaleDate DATE,
    Quantity INT,
    Price DECIMAL(10, 2)
);

INSERT INTO Sales (ProductID, ProductName, SaleDate, Quantity, Price) VALUES
(1, 'Laptop', '2024-01-15', 5, 1000.00),
(2, 'Smartphone', '2024-02-20', 10, 600.00),
(3, 'Headphones', '2024-03-05', 8, 200.00),
-- Add more records for various products and months
```

You can solve this problem using a **dynamic query** to automatically generate the necessary columns for each month.

Requirements for the Query:
Dynamically generate columns for each month based on the available sales data.
Each product should have its own row.
Each month should have its total sales value as a column.

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:password@localhost:3306/sales

'Connected: root@sales'

In [14]:
%%sql
WITH total_sales AS(
SELECT 
    MONTHNAME(SaleDate) Month, ProductName, (Price * Quantity) Total
FROM Products 
JOIN Sales
ON Products.ProductID = Sales.ProductID)
SELECT 
    ProductName,
    SUM(CASE WHEN Month = 'January' THEN Total ELSE 0 END) January
    FROM total_sales
GROUP BY ProductName

 * mysql+pymysql://root:***@localhost:3306/sales
5 rows affected.

[('Laptop', Decimal('5000.00')),
 ('Smartphone', Decimal('0.00')),
 ('Headphones', Decimal('0.00')),
 ('Monitor', Decimal('3500.00')),
 ('Keyboard', Decimal('320.00'))]

In [33]:
%%sql
SET @total_sales = NULL;
SELECT GROUP_CONCAT(
    DISTINCT CONCAT(
        'SUM(CASE WHEN MONTHNAME(SaleDate) = "', MONTHNAME(SaleDate), '" THEN (Price * Quantity) ELSE 0 END) AS "', MONTHNAME(SaleDate), '"'
    ))INTO @total_sales
    FROM Sales;
SET @sql = CONCAT('SELECT ProductName, ', @total_sales, '
    
            FROM Products 
            JOIN Sales
            ON Products.ProductID = Sales.ProductID
            GROUP BY ProductName'
            );
PREPARE stmt FROM @sql;
EXECUTE stmt;

 * mysql+pymysql://root:***@localhost:3306/sales
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.

[('Laptop', Decimal('3150.00'), Decimal('5000.00'), Decimal('0.00')),
 ('Smartphone', Decimal('6000.00'), Decimal('0.00'), Decimal('2480.00')),
 ('Headphones', Decimal('2520.00'), Decimal('0.00'), Decimal('1600.00')),
 ('Monitor', Decimal('0.00'), Decimal('3500.00'), Decimal('2400.00')),
 ('Keyboard', Decimal('0.00'), Decimal('320.00'), Decimal('900.00'))]

In [31]:
%%sql
-- Step 1: Set up the dynamic parts
SET @total_sales = NULL;

-- Step 2: Generate the dynamic SQL to create columns for each month
SELECT 
    GROUP_CONCAT(
        DISTINCT CONCAT(
            'SUM(CASE WHEN MONTHNAME(SaleDate) = "', 
            MONTHNAME(SaleDate), 
            '" THEN (Price * Quantity) ELSE 0 END) AS `', 
            MONTHNAME(SaleDate), '`'
        )
    ) INTO @total_sales
FROM Sales;  -- Assuming Sales table has the TransactionDate field

-- Step 3: Build the full dynamic query
SET @sql = CONCAT('SELECT ProductName, ', @total_sales, '
    FROM Products
    JOIN Sales ON Products.ProductID = Sales.ProductID
    GROUP BY ProductName');

-- Step 4: Prepare, execute, and clean up the dynamic query
PREPARE stmt FROM @sql;
EXECUTE stmt;

 * mysql+pymysql://root:***@localhost:3306/sales
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.

[('Laptop', Decimal('3150.00'), Decimal('5000.00'), Decimal('0.00')),
 ('Smartphone', Decimal('6000.00'), Decimal('0.00'), Decimal('2480.00')),
 ('Headphones', Decimal('2520.00'), Decimal('0.00'), Decimal('1600.00')),
 ('Monitor', Decimal('0.00'), Decimal('3500.00'), Decimal('2400.00')),
 ('Keyboard', Decimal('0.00'), Decimal('320.00'), Decimal('900.00'))]

In [3]:
%sql SELECT * FROM products LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/sales
1 rows affected.

[(1, 'Laptop', 'Electronics')]

In [4]:
%sql SELECT * FROM Sales LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/sales
1 rows affected.

[(1, 1, datetime.date(2024, 1, 15), 5, Decimal('1000.00'))]